[
  {
    "path": "posts/2021-12-08-stichprobenverteilung-bootstrapping-und-nullverteilung/",
    "title": "Stichprobenverteilung, Bootstrapping und Nullverteilung",
    "description": "In diesem Beitrag soll anhand eines illustrativen Beispiels erläutert werden, was es mit einer Stichprobenverteilung eigentlich auf sich hat und wie uns die simulationsbasierte Inferenz mittels Bootstrap- und Nullverteilung dabei hilft, statistische Hypothesen auf einfachste Art und Weise zu überprüfen.",
    "author": [
      {
        "name": "Sascha Schworm",
        "url": "https://www.saschaschworm.de"
      }
    ],
    "date": "2021-12-08",
    "categories": [
      "Simulationsbasierte Inferenz",
      "Stichprobenverteilung",
      "Bootstrap-Verteilung",
      "Nullverteilung"
    ],
    "contents": "\nEinleitung\nAuf eine Umfrage von Schulministerin Gebauer anlässlich der Bewertung der Corona-Lage an den Schulen in Nordrhein-Westfalen, haben 102.000 (Gelgenheitsstichprobe) von insgesamt 146.000 Lehrerinnen und Lehrer (Population) reagiert. Demnach sind rund 90% \\((= p = \\hat \\pi)\\) aller Befragten bereits vollständig geimpft. Dies hört sich zwar nach einer präzisen Schätzung für den Anteil vollständig geimpfter Lehrerinnen und Lehrer in Nordrhein-Westfalen - also in der gesamten Population - an, aber wir würden gerne wissen, wie genau diese Schätzung tatsächlich ist.\n\nDer aus der Stichprobe ermittelte Schätzer ist natürlich nicht erwartungstreu bezüglich des zu schätzenden Populationsparameters. Überlegen Sie sich an der Stelle mal, welche Verzerrungen innerhalb der Stichprobe hier vorliegen könnten. Worst-Case-Szenario: Innerhalb der Stichprobe beträgt der Anteil geimpfter Lehrerinnen und Lehrer absolut 91.800. Im Bezug auf die Population (und bei Annahme, dass alle anderen Lehrerinnen und Lehrer nicht vollständig geimpft sind) sind das gerade mal 59,0414%. Hier zeigt sich deutlich die Gefährlichkeit nicht-probabilistischer Stichproben - selbst bei einem großen Stichprobenumfang.\n\nStichprobenverteilung\nGehen wir nun mal davon aus, dass die Gelegenheitsstichprobe eine echte Zufallsstichprobe ist, wir aus der Population alle möglichen Zufallsstichproben der Größe 102.000 ziehen können und der tatsächliche Anteil geimpfter Lehrerinnen und Lehrer in der Population 90% beträgt. Das ist natürlich unrealistisch und es erfordet - da die Population bekannt ist - eigentlich keinerlei Inferenzstatistik. Diese Annahme soll nur ein illustrativer Zwischenschritt sein.\nFür jede dieser Stichproben berechnen wir dann eine Statistik (z.B. Mittelwert, Standardabweichung, Median, …) - in diesem Fall also den Anteil vollständig geimpfter Lehrerinnen und Lehrer. Die Verteilungsfunktion dieser Statistik ist die Stichprobenverteilung, die uns die Wahrscheinlichkeit angibt, mit der jeder mögliche Wert einer Statistik zufällig aus einer Population gezogen werden kann.\n\n\n\nFigure 1: Histogramm und Wahrscheinlichkeitsdichte der theoretischen Stichprobenverteilung über den Anteil vollständig geimpfter Lehrerinnen und Lehrer.\n\n\n\nDer Stichprobenverteilung können wir entnehmen, dass wenn man eine Stichprobe mit 102.000 zufällig ausgewählten Lehrerinnen und Lehrer aus der Population ziehen würde, die Wahrscheinlichkeit, dass in einer solchen Zufallsstichprobe der Anteil vollständig geimpfter Lehrerinnen und Lehrer zwischen 89,75% und 90,25% liegt, am größten ist. Auch unsere Stichprobe, wo der Anteil vollständig geimpfter Lehrerinnen und Lehrer bei 90% liegt, ist eine konkrete Realisation dieser Stichprobenverteilung.\nUm nun zu beurteilen, wie weit diese auf der Stichprobe basierenden Schätzung durchschnittlich vom wahren Parameter der Population (\\(\\pi\\)) abweicht - also dem tatsächlichem Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population, benötigen wir den Standardfehler, den wir über die Standardabweichung der Statistik auf Basis der Stichprobenverteilung bestimmen können. Diese gibt an, wie sich eine Statistik von Stichprobe zur Stichprobe unterscheidet - in diesem Fall also wie sehr sich der Anteil vollständig geimpfter Lehrerinnen und Lehrer von Stichprobe zu Stichprobe durchschnittlich unterscheidet.\nHier beträgt der Standardfehler rund 0,9368 Prozentpunkte - im Schnitt weicht also der über eine Stichprobe geschätzte Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population um 0,9368 Prozentpunkte vom tatsächlichen Parameter der Population ab. Auf Basis des Standardfehlers können wir also Konfidenzintervalle bilden. Für unsere Stichprobe gilt, dass mit einer Wahrscheinlichkeit von 95% der Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population zwischen 88,164% und 91,836% liegt (\\(p \\pm 1.96 \\cdot \\operatorname*{SE}\\)). Da die Quantile der Stichprobenverteilung bekannt sind, lässt sich das mittlere 95%-Konfidenzintervall auch darüber bestimmen:\n\nTable 1: Auszugsweise Darstellung der Quantile der theoretischen Stichprobenverteilung.\n2.5%\n25%\n50%\n75%\n97.5%\n0.8810\n0.8940\n0.9000\n0.9060\n0.9180\n\nBootstrap-Verteilung\nIn der Praxis kosten Stichproben aber Ressourcen (Zeit, Geld etc.), weswegen das Ziehen von sehr vielen Stichproben mit einem gegebenen Umfang indiskutabel ist. In der Regel ist bei statistischen Untersuchungen auch die Population nicht verfügbar, sondern man hat nur eine Stichprobe, d.h. Umfang der Population, Populationsparameter und der Standardfehler sind unbekannt. Allerdings ist es möglich die Verteilung von Stichprobenstatistiken (Stichprobenverteilung) durch die Verteilung von Bootstrap-Stichproben (Bootstrap-Verteilung) zu approximieren. Diese Approximation ist umso besser, je mehr die vorliegende Stichprobe der Population ähnelt.\n\n\n\nFigure 2: Histogramm und Wahrscheinlichkeitsdichte der über die Bootstrap-Simulation approximierten Stichprobenverteilung über den Anteil vollständig geimpfter Lehrerinnen und Lehrer.\n\n\n\nÜber die Bootstrap-Verteilung lässt sich der Standardfehler, welcher den tatsächlichen Standardfehler der Stichprobenverteilung approximiert, bestimmen. Wohlbemerkt war hierfür nur eine einzige Stichprobe notwendig. Das ermöglicht uns das Bootstrapping. Der hier über das Bootstrapping appproximierte Standardfehler beträgt rund 0,9236 Prozentpunkte - im Schnitt weicht also der über eine Stichprobe geschätzte Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population um 0,9236 Prozentpunkte vom tatsächlichen Parameter der Population ab. Auf Basis des Standardfehlers können wir wiederum Konfidenzintervalle bilden.\nHypothesentest auf Basis der Bootstrap-Verteilung\nFür unsere Stichprobe gilt näherungsweise, dass mit einer Wahrscheinlichkeit von 95% der Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population zwischen 88,1898% und 91,8102% liegt (\\(p \\pm 1.96 \\cdot \\operatorname*{SE}\\)). Da die Quantile der Stichprobenverteilung bekannt sind, lässt sich das mittlere 95%-Konfidenzintervall auch darüber bestimmen:\n\nTable 2: Auszugsweise Darstellung der Quantile der über die Bootstrap-Simulation approximierten Stichprobenverteilung.\n2.5%\n25%\n50%\n75%\n97.5%\n0.8870\n0.9000\n0.9060\n0.9120\n0.9240\n\nDemnach liegt der Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population mit einer Wahrscheinlichkeit von 95% zwischen 88,7% und 92,4%. Die Differenz zwischen diesem Konfidenzintervall und dem Konfidenzintervall, welches über den Standardfehlers ermittelt wurde, kommt dadruch zustande, weil es sich in der vorliegenden Bootstrap-Verteilung nicht exakt um eine Normalverteilung handelt.\nStellt nun jemand die Behauptung auf, dass der Anteil geimpfter Lehrerinnen und Lehrer in der Population bei 94% (\\(H_0: \\pi = 94\\% = 0.94\\)) liegt und wir daran nicht glauben (\\(H_A: \\pi \\ne 0.94\\)), können wir mit Hilfe unseres über die Quantile der Bootstrap-Verteilung ermittelten mittleren 95%-Konfidenzintervalls argumentieren: Da die mittleren 95% aller aus der Population ziehbaren Stichproben zwischen 88,7% und 92,4% liegen bzw. weil der Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population mit einer Wahrscheinlichkeit von 95% zwischen 88,7% und 92,4% liegt, halten wir es für unwahrscheinlich, dass der wahre Anteil in der Population bei 94% liegt, weil sich andernfalls auch andere Stichproben ergeben hätten. Wir lehnen die Nullhypothese demnach ab. Die Wahrscheinlichkeit, dass wir uns hierbei irren (und demnach in der Population der Anteil tatsächlich 94% beträgt), liegt bei 5% (\\(\\alpha\\), Signifikanzniveau, Irrtumswahrscheinlichkeit).\nNullverteilung\nMit Hilfe der Bootstrap-Simulation approximieren wir die theoretische Verteilung von Stichprobenstatistiken (Stichprobenverteilung) so, wie sie sich real ergeben, wenn man (unendlich oft) Stichproben aus der Population ziehen würde. Eine Alternative hierzu stellt die Nullverteilung dar. Auch sie ist eine Stichprobenverteilung, allerdings liegt ihr die Annahme zugrunde, wie sich Stichproben (und demnach Stichprobenstatistiken) der Größe \\(n\\) ergeben würden, wenn in der Population ein bestimmter Parameter gilt. In unserem Fall könnte man also in Anlehnung an der vorherigen Hypothesentest die Frage stellen, wie sich Stichproben der Größe 102.000 ergeben würden, wenn der Anteil vollständig geimpfter Lehrerinnen und Lehrer in der Population bei 94% (\\(H_0: \\pi = 94\\% = 0.94\\), daher Nullverteilung) liegt. Hierzu müssen also gemäß dieser Voraussetzung Daten generiert werden, was in diesem konkreten Fall durch die Simulation von Münzwürfen realisiert werden kann.\n\n\n\nFigure 3: Histogramm und Wahrscheinlichkeitsdichte der über die Simulation generierten Nullverteilung über den Anteil vollständig geimpfter Lehrerinnen und Lehrer.\n\n\n\nDer Nullverteilung (resp. Stichprobenverteilung) können wir entnehmen, dass wenn man eine Stichprobe mit 102.000 zufällig ausgewählten Lehrerinnen und Lehrer aus einer Population zieht, wo der Anteil vollständig geimpfter Lehrerinnen und Lehrer bei 94% liegt, die Wahrscheinlichkeit, dass in einer solchen Zufallsstichprobe der Anteil vollständig geimpfter Lehrerinnen und Lehrer zwischen 93,975% und 94,025% liegt, am größten ist.\nHypothesentest auf Basis der Nullverteilung\nDa die Quantile der Nullverteilung bekannt sind, lässt sich das mittlere 95%-Konfidenzintervall auch darüber bestimmen:\n\nTable 3: Auszugsweise Darstellung der Quantile der über die Simulation generierten Nullverteilung.\n2.5%\n25%\n50%\n75%\n97.5%\n0.9385196\n0.9395\n0.9400\n0.9404828\n0.9414314\n\nDa die mittleren 95% aller in einer solchen Population ziehbaren Stichproben zwischen 93,852% und 94,1431% liegen, halten wir es für unwahrscheinlich, dass wir eine reale empirische Stichprobe, wo der Anteil vollständig geimpfter Lehrerinnen und Lehrer bei 90% liegt, aus einer solchen Population ziehen würden. Demnach lehnen wir die Nullhypothese (\\(H_0: \\pi = 94\\% = 0.94\\)), die der Simulation zugrunde liegt, ab.\nÜber die Nullverteilung lässt sich auch bestimmen, wie wahrscheinlich es ist, die empirisch gemessene Stichprobenstatistik (in unserem Fall 90%) und extremere Werte zu erhalten, wenn die Nullhypothese tatsächlich stimmen würde. Diesen Wert bezeichnet man auch als p-Wert (Überschreitungswahrscheinlichkeit) und ist die Randwahrscheinlichkeit einer Teststatistik unter der Nullhypothese.\nIn unserem Fall liegt dieser Wert praktisch bei 0%. Das bedeutet, dass die Wahrscheinlichkeit, eine Stichprobe, wo der Anteil vollständig geimpfter Lehrerinnen und Lehrer bei 90% liegt, aus einer Population, wo der Anteil vollständig geimpfter Lehrerinnen und Lehrer bei 94% liegen soll, bei 0% liegt. Auch deswegen kommen wir hier zum Ergebnis, dass in der Population der Anteil nicht bei 94% liegen kann und wir demnach die Nullhypothese ablehnen.\n\n\n\n",
    "preview": "posts/2021-12-08-stichprobenverteilung-bootstrapping-und-nullverteilung/stichprobenverteilung-bootstrapping-und-nullverteilung_files/figure-html5/sampling-distribution-plot-1.png",
    "last_modified": "2021-12-08T18:03:45+01:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
